Revit 2027 API
CurveByPoints.GetVisibility Method
Gets the visibility.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyElementVisibility GetVisibility()
Public Function GetVisibility As FamilyElementVisibility
public:
FamilyElementVisibility^ GetVisibility()
member GetVisibility : unit -> FamilyElementVisibility
Return Value
FamilyElementVisibility
A copy of visibility settings for the curve.
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace